{
  "message": null,
  "panels": {
    "is_name": true,
    "is_guide": true,
    "is_rule": true,
    "is_setting": true,
    "is_menu": true,
    "is_button": true,
    "lang": "en",
    "msg_color": "BLUE",
    "menu_name": "Frequently Asked Question (FAQ)",
    "button_color": "PRIMARY",
    "button_emoji": "<:logo:1281113840280539137>",
    "button_name": "Contact Support",
    "image": "jVtMuP1.png",
    "title": null,
    "description": null,
    "desc_image": null,
    "url": null
  },
  "modals": [
    {
      "name": "Feedback / Questions",
      "placeholder": "Please explain the reason",
      "style": "PARAGRAPH",
      "required": true,
      "minLength": "0",
      "maxLength": "1000"
    },
    {
      "name": "Topic",
      "placeholder": "Enter the topic",
      "style": "SHORT",
      "required": false,
      "minLength": "0",
      "maxLength": "100"
    }
  ],
  "options": [
    {
      "emoji": "<:discord:1298193629625716776>",
      "label": "Discord – Community Guidelines",
      "description": "Discord",
      "msg_image": "IvJ3ifV.png",
      "msg_description": "The **Discord Community Guidelines** set rules to ensure a safe and positive environment for all users. Key points include:\r\n\r\n1. **Respect for Others**: Users must not engage in harassment, hate speech, bullying, or discriminatory behavior.\r\n   \r\n2. **No Harmful Content**: Sharing illegal, violent, or adult content, including graphic violence or nudity, is strictly prohibited.\r\n\r\n3. **Prohibited Activities**: Scams, fraud, promotion of dangerous or illegal activities, doxing (sharing private information without consent), and spamming are banned.\r\n\r\n4. **Respect Privacy**: Do not record or distribute conversations without consent, and avoid sharing personal information.\r\n\r\n5. **No Exploitation**: Manipulating the platform, distributing malware, hacking, or using self-bots is forbidden.\r\n\r\n6. **Authenticity**: Users should not impersonate others, and accounts should reflect genuine interactions.\r\n\r\n7. **Age Restrictions**: Users must be at least 13 years old (or older depending on local laws).\r\n\r\n8. **Bot and Automation Use**: Bots must comply with Discord’s API and should not spam or overwhelm users.\r\n\r\nThese guidelines promote a respectful, safe, and positive community experience for all members. Violating them can result in account suspension or permanent bans.",
      "msg_color": "BLUE",
      "url": "https://raw.githubusercontent.com/FaizoKen/QuickSupport/refs/heads/main/sample-documents/Discord%20%E2%80%93%20Community%20Guidelines.md"
    },
    {
      "emoji": "<:discord:1298193629625716776>",
      "label": "Discord – Privacy Policy",
      "description": "Discord",
      "msg_image": "IvJ3ifV.png",
      "msg_description": "The **Discord Privacy Policy** explains how Discord collects, uses, and shares personal data to provide and improve its services. Key points include:\r\n\r\n1. **Data Collection**:\r\n   - **Account Information**: Discord collects information when you create an account, including your username, email, and IP address.\r\n   - **Usage Data**: Discord gathers data on how you interact with the platform (messages, voice chats, servers you join, etc.).\r\n   - **Device Information**: Information like your operating system, device type, and settings may be collected.\r\n   - **Third-Party Services**: If you connect external accounts (e.g., Spotify, YouTube), Discord may collect related data.\r\n\r\n2. **Data Use**:\r\n   - **Service Provision**: Your data is used to provide, maintain, and improve Discord’s services.\r\n   - **Personalization**: Discord uses data to tailor features and recommendations to individual users.\r\n   - **Safety and Security**: Data is used to detect and prevent harmful activities, enforce guidelines, and maintain security.\r\n   - **Communication**: Discord may use data to send you updates or promotional content.\r\n\r\n3. **Data Sharing**:\r\n   - Discord shares data with third-party service providers (like payment processors) to run the service but doesn’t sell user data.\r\n   - It may share information for legal compliance, protecting users, or in case of mergers and acquisitions.\r\n\r\n4. **Data Control**:\r\n   - **User Control**: Users can access, correct, or delete their personal data, and can manage privacy settings.\r\n   - **Retention**: Discord retains data as long as necessary to provide services or meet legal obligations.\r\n   - **Data Protection**: Discord uses encryption and other security measures to protect user data.\r\n\r\n5. **Children's Privacy**: Discord requires users to be at least 13 years old (or older in some jurisdictions).\r\n\r\n6. **International Data Transfers**: User data may be transferred internationally, with protections in place for data shared outside of the user’s country.\r\n\r\nOverall, Discord prioritizes user privacy while using collected data to enhance the platform and ensure a secure environment.",
      "msg_color": "BLUE",
      "url": "https://raw.githubusercontent.com/FaizoKen/QuickSupport/refs/heads/main/sample-documents/Discord%20%E2%80%93%20Privacy%20Policy.md"
    },
    {
      "emoji": "<:discord:1298193629625716776>",
      "label": "Discord – Terms of Service",
      "description": "Discord",
      "msg_image": "IvJ3ifV.png",
      "msg_description": "The **Discord Terms of Service** outline the rules and conditions users must follow when using Discord's platform. Key points include:\r\n\r\n1. **Account Eligibility**:\r\n   - Users must be at least 13 years old, or older if required by local laws.\r\n   - You are responsible for your account's security and all activities on it. Discord can disable accounts for rule violations.\r\n\r\n2. **User Conduct**:\r\n   - Users must follow community guidelines, avoiding illegal activities, harassment, and harmful content.\r\n   - Use of the platform should not violate intellectual property rights or local laws.\r\n   - Automated bots or scripts (like self-bots) should not interfere with Discord’s operations or other users.\r\n\r\n3. **Content Ownership**:\r\n   - Users retain ownership of the content they post but grant Discord a license to use, distribute, and display that content as part of their service.\r\n   - Discord may remove content that violates its policies or laws.\r\n\r\n4. **Platform Use**:\r\n   - Discord is provided \"as-is\" without warranties, meaning users cannot hold Discord liable for technical issues or disruptions.\r\n   - Discord can modify or terminate services at any time, with or without notice.\r\n\r\n5. **Purchases and Payments**:\r\n   - For premium services like Nitro, users agree to pay the listed prices. Payments may auto-renew unless canceled.\r\n   - Refunds are generally not offered unless required by law.\r\n\r\n6. **Termination**:\r\n   - Discord may suspend or delete accounts that violate the Terms of Service or other policies.\r\n   - Users can terminate their account anytime by deleting it.\r\n\r\n7. **Dispute Resolution**:\r\n   - Most disputes between users and Discord are handled via arbitration, not court.\r\n   - Legal claims must be filed within one year of the dispute, and class action lawsuits are generally not allowed.\r\n\r\n8. **Limitation of Liability**:\r\n   - Discord's liability for damages is limited, and the company is not responsible for user-generated content.\r\n\r\nBy using Discord, users agree to these terms and must comply with the rules to maintain access to the platform.",
      "msg_color": "BLUE",
      "url": "https://raw.githubusercontent.com/FaizoKen/QuickSupport/refs/heads/main/sample-documents/Discord%20%E2%80%93%20Terms%20of%20Service.md"
    }
  ]
}
